###############################################################################
# Created by write_sdc
###############################################################################
current_design sync_fifo
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 12.5000 [get_ports {clk}]
set_clock_uncertainty 0.1000 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_en_i}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data_i[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data_i[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data_i[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data_i[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data_i[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data_i[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data_i[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data_i[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data_i[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data_i[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data_i[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data_i[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data_i[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data_i[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data_i[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data_i[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_en_i}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {empty_o}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {full_o}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data_o[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data_o[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data_o[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data_o[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data_o[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data_o[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data_o[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data_o[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data_o[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data_o[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data_o[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data_o[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data_o[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data_o[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data_o[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data_o[9]}]
set_false_path\
    -from [get_ports {rst_n}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0500 [get_ports {empty_o}]
set_load -pin_load 0.0500 [get_ports {full_o}]
set_load -pin_load 0.0500 [get_ports {rd_data_o[15]}]
set_load -pin_load 0.0500 [get_ports {rd_data_o[14]}]
set_load -pin_load 0.0500 [get_ports {rd_data_o[13]}]
set_load -pin_load 0.0500 [get_ports {rd_data_o[12]}]
set_load -pin_load 0.0500 [get_ports {rd_data_o[11]}]
set_load -pin_load 0.0500 [get_ports {rd_data_o[10]}]
set_load -pin_load 0.0500 [get_ports {rd_data_o[9]}]
set_load -pin_load 0.0500 [get_ports {rd_data_o[8]}]
set_load -pin_load 0.0500 [get_ports {rd_data_o[7]}]
set_load -pin_load 0.0500 [get_ports {rd_data_o[6]}]
set_load -pin_load 0.0500 [get_ports {rd_data_o[5]}]
set_load -pin_load 0.0500 [get_ports {rd_data_o[4]}]
set_load -pin_load 0.0500 [get_ports {rd_data_o[3]}]
set_load -pin_load 0.0500 [get_ports {rd_data_o[2]}]
set_load -pin_load 0.0500 [get_ports {rd_data_o[1]}]
set_load -pin_load 0.0500 [get_ports {rd_data_o[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rd_en_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_en_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data_i[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data_i[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data_i[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data_i[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data_i[0]}]
set_input_transition 0.2000 [get_ports {clk}]
set_input_transition 0.2000 [get_ports {rd_en_i}]
set_input_transition 0.2000 [get_ports {rst_n}]
set_input_transition 0.2000 [get_ports {wr_en_i}]
set_input_transition 0.2000 [get_ports {wr_data_i[15]}]
set_input_transition 0.2000 [get_ports {wr_data_i[14]}]
set_input_transition 0.2000 [get_ports {wr_data_i[13]}]
set_input_transition 0.2000 [get_ports {wr_data_i[12]}]
set_input_transition 0.2000 [get_ports {wr_data_i[11]}]
set_input_transition 0.2000 [get_ports {wr_data_i[10]}]
set_input_transition 0.2000 [get_ports {wr_data_i[9]}]
set_input_transition 0.2000 [get_ports {wr_data_i[8]}]
set_input_transition 0.2000 [get_ports {wr_data_i[7]}]
set_input_transition 0.2000 [get_ports {wr_data_i[6]}]
set_input_transition 0.2000 [get_ports {wr_data_i[5]}]
set_input_transition 0.2000 [get_ports {wr_data_i[4]}]
set_input_transition 0.2000 [get_ports {wr_data_i[3]}]
set_input_transition 0.2000 [get_ports {wr_data_i[2]}]
set_input_transition 0.2000 [get_ports {wr_data_i[1]}]
set_input_transition 0.2000 [get_ports {wr_data_i[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.5000 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 6.0000 [current_design]
